In [1]:
import pandas as pd
import numpy as np
import scipy
import matplotlib.pyplot as plt
import math
from scipy import stats
from scipy.stats import f
import statsmodels.api as sm
from statsmodels.formula.api import ols

In [2]:
a=[4,3,2]
b=[2,4,6]
c=[2,1,3]

In [3]:
stats.f_oneway(a,b,c)

F_onewayResult(statistic=1.5, pvalue=0.2962962962962962)

In [4]:
data=pd.read_excel('D:/Sonali/data analytics/oneway.xlsx')
data

   Teaching Methodology1  Teaching Methodology2  Teaching Methodology3
0                      4                      2                      2
1                      3                      4                      1
2                      2                      6                      3

In [6]:
data_new=pd.melt(data.reset_index(),id_vars=['index'],value_vars=['Teaching Methodology1','Teaching Methodology2','Teaching Methodology3'])
data_new.columns=['index','Treatments','value']

In [7]:
data_new

   index             Treatments  value
0      0  Teaching Methodology1      4
1      1  Teaching Methodology1      3
2      2  Teaching Methodology1      2
3      0  Teaching Methodology2      2
4      1  Teaching Methodology2      4
5      2  Teaching Methodology2      6
6      0  Teaching Methodology3      2
7      1  Teaching Methodology3      1
8      2  Teaching Methodology3      3

In [8]:
model=ols('value ~ C(Treatments)',data=data_new).fit()
anova_table=sm.stats.anova_lm(model,typ=1)
anova_table

                df  sum_sq  mean_sq    F    PR(>F)
C(Treatments)  2.0     6.0      3.0  1.5  0.296296
Residual       6.0    12.0      2.0  NaN       NaN